xlloss/RA4E2_HDMI_CEC_RX/src/hal_entry.c
    /* Set my vendor ID */
#if (APP_VENDOR_ID_INSTALL == 0)
    APP_PRINT("Fixed vendor ID will be used.\r\n");
#else
    APP_PRINT("Setting up my vendor ID ...\r\n");
    vendor_id_install(&my_vendor_id[0]);
#endif
    APP_PRINT("My vendor ID is 0x%02x, 0x%02x, 0x%02x.\r\n\r\n",
            my_vendor_id[0], my_vendor_id[1], my_vendor_id[2]);

    /* Open CEC module */
    fsp_err = R_CEC_Open(&g_cec0_ctrl, &g_cec0_cfg);
    if(FSP_SUCCESS != fsp_err){ ERROR_INDICATE_LED_ON; __BKPT(0); }

    /* Make 50 milliseconds delay. R_CEC_MediaInit may return
     * FSP_ERR_IN_USE for up to 45 milliseconds after
     * calling R_CEC_Open
     */
    R_BSP_SoftwareDelay(50, BSP_DELAY_UNITS_MILLISECONDS);

    /* Initialize CEC logical address */
    fsp_err = cec_logical_address_allocate();
    if(FSP_SUCCESS != fsp_err)
    {
        APP_PRINT("CEC logical address allocation failed.\r\n");
        ERROR_INDICATE_LED_ON; __BKPT(0);
    }

    APP_PRINT("CEC logical address allocation completed.\r\n");

    /* Now we recognize my logical address,
     * update internal cec bus device status buffer with my device info
     */
    cec_bus_device_list[my_logical_address].is_power_status_store = true;
    cec_bus_device_list[my_logical_address].power_status = 0x1;

    cec_bus_device_list[my_logical_address].is_version_store = true;
    cec_bus_device_list[my_logical_address].cec_version = CEC_VERSION_1_4;

    cec_bus_device_list[my_logical_address].is_physical_address_store = true;
    memcpy(&cec_bus_device_list[my_logical_address].physical_address[0], &my_physical_address[0], 4);

    cec_bus_device_list[my_logical_address].is_vendor_id_store = true;
    memcpy(&cec_bus_device_list[my_logical_address].vendor_id[0], &my_vendor_id[0], 3);

    /* Clear all internal flags */
    user_action_detect_flag = false;
    cec_rx_complete_flag = false;

    APP_PRINT(APP_COMMAND_OPTION,
              system_audio_mode_support_function ? SYS_AUDIO_FUNC_E : SYS_AUDIO_FUNC_D,
              system_audio_mode_status ? SYS_AUDIO_ON : SYS_AUDIO_OFF);

    while(1)
    {
        user_action_check();
        if(user_action_detect_flag)
        {
            user_action_detect_flag = false;
            user_action_process(cec_data);
        }

        cec_rx_data_check();
        if(cec_action_request_detect_flag)
        {
            cec_rx_data_process(cec_action_type);
        }

        R_BSP_SoftwareDelay(1, BSP_DELAY_UNITS_MILLISECONDS);
    }
}

void cec_interrupt_callback(cec_callback_args_t *p_args)
{
    switch (p_args->event)
    {
        case CEC_EVENT_READY:
        {
            /* In this demo, the ready flag is received by R_CEC_StatusGet(). But application can also get with this interrupt event. */
            RTT_DEBUG("@@@ READY\r\n");
            break;
        }
        case CEC_EVENT_TX_COMPLETE:
        {
            /* Application processing after transmission has completed. */
            RTT_DEBUG("@@@ TX COMP\r\n");
            cec_tx_complete_flag = true;
            break;
        }
        case CEC_EVENT_RX_DATA:
        {
            RTT_DEBUG("@@@ RX 0x%x\r\n", p_args->data_byte);
            /* Application to store and process received data bytes. */
            cec_rx_message_buff_t* p_buff = &cec_rx_data_buff[cec_rx_data_buff_next_store_point];
            if(p_buff->byte_counter == 0)
            {
                p_buff->source = (uint8_t)(p_args->data_byte >> 4);
                p_buff->destination = (uint8_t)(p_args->data_byte & 0xF);
            }
            else if(p_buff->byte_counter == 1)
            {
                p_buff->opcode = p_args->data_byte;
            }
            else
            {
                p_buff->data_buff[p_buff->byte_counter - 2] = p_args->data_byte;
            }

            p_buff->byte_counter++;
            if(p_buff->byte_counter == CEC_DATA_BUFFER_LENGTH)
            {
                p_buff->byte_counter = 0;
            }
            break;
        }
        case CEC_EVENT_RX_COMPLETE:
        {
            /* Application processing for message reception complete. */
            RTT_DEBUG("@@@ RX COMP\r\n");

            cec_rx_data_buff[cec_rx_data_buff_next_store_point].is_new_data = true;

            cec_rx_data_buff_next_store_point++;
            if(cec_rx_data_buff_next_store_point >= CEC_RX_DATA_BUFF_DATA_NUMBER)
            {
                cec_rx_data_buff_next_store_point = 0;
            }
            break;
        }
        case CEC_EVENT_ERR:
        {
            cec_err_flag = true;
            cec_err_type = p_args->errors;

            if(cec_err_type & (CEC_ERROR_OERR | CEC_ERROR_TERR))
            {
                cec_rx_message_buff_t* p_buff = &cec_rx_data_buff[cec_rx_data_buff_next_store_point];
                if(p_buff->byte_counter > 0)
                {
                    p_buff->is_error = true;

                    /* Cancel on-going store buffer */
                    p_buff->is_new_data = true;
                    cec_rx_data_buff_next_store_point++;
                    if(cec_rx_data_buff_next_store_point >= CEC_RX_DATA_BUFF_DATA_NUMBER)
                    {
                        cec_rx_data_buff_next_store_point = 0;
                    }
                }
            }

            RTT_DEBUG("@@@ ERR 0x%x\r\n", cec_err_type);
            break;
        }
        default:
        {
            /* Do nothing */
            break;
        }
    }
}

fsp_err_t cec_message_send(cec_addr_t destination, uint8_t opcode, uint8_t const * data_buff, uint8_t data_buff_length)
{
    fsp_err_t fsp_err = FSP_SUCCESS;
    cec_message_t cec_tx_message;
    uint8_t       cec_tx_message_length; /* Total message size, including header, opcode, and data */
    uint8_t       err_detect = false;
    uint32_t      timeout_ms = (uint32_t)(5 + 40 * (2 + data_buff_length));
    uint32_t      opcode_list_point;
    APP_PRINT("[> CEC Out] Dest: %d (%s),\r\n", destination,
        &cec_logical_device_list[destination][0]);

