xlloss/RA4E2_HDMI_CEC_RX/src/hal_entry.c
            if(logical_address_allocate == false)
            {
                fsp_err = cec_logical_address_allocate_attempt(CEC_ADDR_PLAYBACK_DEVICE_3);
                if(fsp_err == FSP_SUCCESS)
                {
                    logical_address_allocate = true;
                    my_logical_address = CEC_ADDR_PLAYBACK_DEVICE_3;
                }
            }
            break;
        }
        case '5':
        {
            fsp_err = cec_logical_address_allocate_attempt(CEC_ADDR_AUDIO_SYSTEM);
            if(fsp_err == FSP_SUCCESS)
            {
                logical_address_allocate = true;
                my_logical_address = CEC_ADDR_AUDIO_SYSTEM;
            }
            break;
        }
        default:
        {
            /* Do nothing */
            break;
        }
    }

RESULT_LOGICAL_ADDRESS:
    if(logical_address_allocate)
    {
        cec_bus_device_list[my_logical_address].is_device_active = true;
        cec_bus_device_list[my_logical_address].is_my_device = true;
        APP_PRINT("Logical address %s has been allocated.\r\n", cec_logical_device_list[my_logical_address]);
        return FSP_SUCCESS;
    }
    else
    {
        APP_PRINT("The Selected logical address type is in use by"
            "another device. Enter another one.\r\n");
        return FSP_ERR_IN_USE;
    }
}

fsp_err_t cec_logical_address_allocate_attempt(cec_addr_t logical_addr)
{
    fsp_err_t fsp_err = FSP_SUCCESS;
    cec_status_t cec_status;
    uint32_t timeout_ms = 100;

    do{
        fsp_err = R_CEC_MediaInit(&g_cec0_ctrl, logical_addr);
    }while(FSP_ERR_IN_USE == fsp_err);
    if(FSP_SUCCESS != fsp_err){ ERROR_INDICATE_LED_ON; __BKPT(0); }

    /* Wait for local address allocation and CEC bus to be free */
    do{
        fsp_err = R_CEC_StatusGet(&g_cec0_ctrl, &cec_status);
        timeout_ms--;
        if(timeout_ms == 0)
        {
            break;
        }
        R_BSP_SoftwareDelay(1, BSP_DELAY_UNITS_MILLISECONDS);
    }while((FSP_SUCCESS == fsp_err) && (CEC_STATE_READY != cec_status.state));

    if(CEC_STATE_READY != cec_status.state)
    {
        return FSP_ERR_IN_USE;
    }

    return FSP_SUCCESS;
}

void cec_system_audio_mode_support_enabling(void)
{
    system_audio_mode_support_function = !system_audio_mode_support_function;

    if(system_audio_mode_support_function)
    {
        APP_PRINT("System Audio mode function support enabled.\r\n");
    }
    else
    {
        if(system_audio_mode_status)
        {
            uint8_t    cec_data[CEC_DATA_BUFFER_LENGTH];

            cec_data[0] = CEC_SYSTEM_AUDIO_STATUS_OFF;
            cec_message_send(CEC_ADDR_TV, CEC_OPCODE_SET_SYSTEM_AUDIO_MODE, &cec_data[0], 1);

            APP_PRINT("System Audio mode is disabled.\r\n");
        }

        APP_PRINT("System Audio mode function support disabled.\r\n");
    }
}

void cec_system_audio_mode_request(void)
{
    fsp_err_t fsp_err = FSP_SUCCESS;
    bool       active_source_find = false;
    uint8_t    cec_data[CEC_DATA_BUFFER_LENGTH];

    /* Enable System Audio mode support */
    system_audio_mode_support_function = true;

    if(system_audio_mode_status == false)
    {
        /* The Active source must be checked to request System Audio mode */
        for(int i=0; i<12; i++)
        {
            if(cec_bus_device_list[i].is_active_source)
            {
                APP_PRINT("Current active source is %s.\r\n", &cec_logical_device_list[i]);
                active_source_find = true;
                break;
            }
        }

        if(active_source_find)
        {
            /* Disable System Audio mode once */
            cec_data[0] = CEC_SYSTEM_AUDIO_STATUS_OFF;
            cec_message_send(CEC_ADDR_TV, CEC_OPCODE_SET_SYSTEM_AUDIO_MODE, &cec_data[0], 1);

            R_BSP_SoftwareDelay(300, BSP_DELAY_UNITS_MILLISECONDS);

            APP_PRINT("Sending System Audio On request ...\r\n");

            cec_data[0] = CEC_SYSTEM_AUDIO_STATUS_ON;
            fsp_err = cec_message_send(CEC_ADDR_TV, CEC_OPCODE_SET_SYSTEM_AUDIO_MODE, &cec_data[0], 1);
            if(FSP_SUCCESS == fsp_err)
            {
                APP_PRINT("System Audio mode is disabled.\r\n");
                system_audio_mode_status = true;
            }
            else
            {
                APP_PRINT("System Audio mode request failed.\r\n");
                system_audio_mode_status = false;
            }
        }
        else
        {
            APP_PRINT("Active source is not found. Try bus scan to get.\r\n");
        }
    }
    else
    {
        cec_data[0] = CEC_SYSTEM_AUDIO_STATUS_OFF;
        cec_message_send(CEC_ADDR_TV, CEC_OPCODE_SET_SYSTEM_AUDIO_MODE, &cec_data[0], 1);

        APP_PRINT("System Audio mode is disabled.\r\n");

        system_audio_mode_status = false;
    }

}

void cec_rx_data_check(void)
{
    static uint8_t buff_read_point = 0;
    cec_rx_message_buff_t* p_buff;
    uint32_t opcode_list_point;

    for(uint32_t i=0; i<CEC_RX_DATA_BUFF_DATA_NUMBER; i++)
    {
        p_buff = &cec_rx_data_buff[buff_read_point];

        if(!p_buff->is_new_data)
            continue;

        if(p_buff->is_error)
            goto clear_data;

        APP_PRINT("[< CEC In]  Src: %d (%s), Dest: %d (%s),\r\n",
                 p_buff->source, &cec_logical_device_list[p_buff->source][0],
                 p_buff->destination, &cec_logical_device_list[p_buff->destination][0]);

        if(p_buff->byte_counter < 2)
            goto clear_data;

        opcode_list_point = opcode_description_find(p_buff->opcode);
        APP_PRINT("Opcode: 0x%x (%s)", p_buff->opcode,
               &cec_opcode_list[opcode_list_point].opcode_desc_str[0]);

        if(p_buff->byte_counter >= 3)
        {
           APP_PRINT(", Data: ");
           for(int j=0; j<(p_buff->byte_counter-2); j++)
           {
               APP_PRINT("0x%x,", p_buff->data_buff[j]);
           }
        }

        APP_PRINT("\r\n");

        if(p_buff->source == my_logical_address)
            goto clear_data;

        cec_opecode_reg = p_buff->opcode;

        switch(p_buff->opcode)
        {
            case CEC_OPCODE_ACTIVE_SOURCE:
            {
                cec_action_request_detect_flag = false;
                cec_action_type = CEC_ACTION_POWER_ON;
                cec_opecode_param1_reg = p_buff->data_buff[0] |
                            p_buff->data_buff[1] |
                            p_buff->data_buff[2] |
                            p_buff->data_buff[3];
                break;
            }
            case CEC_OPCODE_IMAGE_VIEW_ON:
            {
                cec_action_request_detect_flag = true;
                cec_action_type = CEC_ACTION_POWER_ON;
                break;
            }
            case CEC_OPCODE_STANDBY:
            {
                cec_action_request_detect_flag = true;
                cec_action_type = CEC_ACTION_POWER_OFF;
                break;
            }
            case CEC_OPCODE_USER_CONTROL_PRESSED:
            {
                switch(p_buff->data_buff[0])
                {
                    case USER_CONTROL_VOLUME_UP:
                        cec_action_request_detect_flag = true;
                        cec_action_type = CEC_ACTION_VOLUME_UP;
                        break;
                    case USER_CONTROL_VOLUME_DOWN:
                        cec_action_request_detect_flag = true;
                        cec_action_type = CEC_ACTION_VOLUME_DOWN;
                        break;
                    case USER_CONTROL_MUTE:
                        cec_action_request_detect_flag = true;
                        cec_action_type = CEC_ACTION_VOLUME_MUTE;
                        break;
                    default:
                        /* Do nothing */
                        break;
                }
                break;
            }
            //case <opcode> ToDo
            //{
            //    /* Add your additional operation */
            //    break;
            //}
            default:
            {
                /* Auto response to supporting (sysytem-level) commands */
                cec_system_auto_response(p_buff);
                break;
            }
        }

